article/gentoo-efi.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="generator" content=
"HTML Tidy for HTML5 for Apple macOS version 5.8.0">
<!-- 2024-12-27 Fri 10:33 -->
<meta name="viewport" content=
"width=device-width, initial-scale=1">
<title>Boot Gentoo Cleanly using EFI Stub</title>
<meta name="author" content="RadioNoiseE">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" type="text/css" href="../style/article.css">
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Boot Gentoo Cleanly using EFI Stub</h1>
</header>
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc210252">1. Background</a></li>
<li><a href="#orgde6731f">2. Kernel</a>
<ul>
<li><a href="#org6a2fe96">2.1. Configuration</a></li>
<li><a href="#org781ffbd">2.2. Install</a></li>
<li><a href="#org6179d44">2.3. Initramfs</a></li>
</ul>
</li>
<li><a href="#org3ef3bdc">3. EFI Partition</a></li>
<li><a href="#orgc7ca3e7">4. EFI Variables Filesystem</a></li>
<li><a href="#org166aaa2">5. Create Boot Entry</a></li>
<li><a href="#orgfa56187">6. Troubleshoot</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orgc210252" class="outline-2">
<h2 id="orgc210252"><span class="section-number-2">1.</span>
Background</h2>
<div class="outline-text-2" id="text-1">
<p>In order to boot the Linux kernel, one traditionally needs a
bootloader like Grub or chainloader like rEFInd. However, these are
ugly (text-only ones look alright, but graphic ones with low
resolution images really don't look good), slow and no longer
necessary.</p>
<p>Modern PC comes with UEFI support, which enables us to directly
load kernel images from the EFI partition without the need for any
bootloader or chainloaders.</p>
</div>
</div>
<div id="outline-container-orgde6731f" class="outline-2">
<h2 id="orgde6731f"><span class="section-number-2">2.</span>
Kernel</h2>
<div class="outline-text-2" id="text-2"></div>
<div id="outline-container-org6a2fe96" class="outline-3">
<h3 id="org6a2fe96"><span class="section-number-3">2.1.</span>
Configuration</h3>
<div class="outline-text-3" id="text-2-1">
<p>You should enable native EFI support and EFI stub support for
the kernel.</p>
<div class="org-src-container">
<pre class="src src-nil">Processor type and features ---&gt;
   [*] EFI runtime service support
   [*]   EFI stub support
   [ ]     EFI mixed-mode support
</pre></div>
<p>You are also recommended to embed the root partition information
into the kernel.</p>
<div class="org-src-container">
<pre class="src src-nil">Processor type and features ---&gt;
   [*] Built-in kernel command line
       (root=/dev/nvme0n1p3)
</pre></div>
</div>
</div>
<div id="outline-container-org781ffbd" class="outline-3">
<h3 id="org781ffbd"><span class="section-number-3">2.2.</span>
Install</h3>
<div class="outline-text-3" id="text-2-2">
<p>Build the kernel and install the kernel modules.</p>
<div class="org-src-container">
<pre class="src src-bash">make -j &amp;& make modules_install
</pre></div>
</div>
</div>
<div id="outline-container-org6179d44" class="outline-3">
<h3 id="org6179d44"><span class="section-number-3">2.3.</span>
Initramfs</h3>
<div class="outline-text-3" id="text-2-3">
<p>An initramfs might be necessary. For example if you embedded the
root partition information into the kernel, or you use btrfs
subvolumes.</p>
</div>
</div>
</div>
<div id="outline-container-org3ef3bdc" class="outline-2">
<h2 id="org3ef3bdc"><span class="section-number-2">3.</span> EFI
Partition</h2>
<div class="outline-text-2" id="text-3">
<p>Create an EFI system partition if you don't have one (will this
ever happen?). This ESP should then be mounted at
<code>/efi</code>. Then make the below directory structure:</p>
<div class="org-src-container">
<pre class="src src-nil">/efi
└── EFI
    └── Gentoo
        ├── initramfs.img
        └── bzImage.efi
</pre></div>
<p>The <code>bzImage.efi</code> should be copied from
<code>/usr/src/linux/arch/x86/boot/bzImage</code>. The
<code>initramfs.img</code> is optional, copied from the initramfs
only when needed.</p>
<p>Inside the <code>EFI</code> directory, there can be more than
one subdirectories containing stub images for more than one
system.</p>
</div>
</div>
<div id="outline-container-orgc7ca3e7" class="outline-2">
<h2 id="orgc7ca3e7"><span class="section-number-2">4.</span> EFI
Variables Filesystem</h2>
<div class="outline-text-2" id="text-4">
<p>The tool we use to create and manage the boot entries requires
the EFI variables filesystem to be accessible (i.e., properly
mounted).</p>
<p>Run the following command to check if it is mounted
properly:</p>
<div class="org-src-container">
<pre class="src src-bash">mount | grep efivars
</pre></div>
<p>If it is mounted as <code>ro</code>, remount it with
<code>rw</code> so that we can create and modify EFI boot
entries.</p>
</div>
</div>
<div id="outline-container-org166aaa2" class="outline-2">
<h2 id="org166aaa2"><span class="section-number-2">5.</span> Create
Boot Entry</h2>
<div class="outline-text-2" id="text-5">
<p>First execute <code>efibootmgr</code> without any options to
list the existing boot entries. Remove unnecessary or obsolete one
with:</p>
<div class="org-src-container">
<pre class=
"src src-bash">efibootmgr -b 2 -B # select the `Bootx002 entry and remove it'
</pre></div>
<p>Then create an entry for our system.</p>
<div class="org-src-container">
<pre class=
"src src-bash">efibootmgr -c -d /dev/nvme0n1 -p 2 -L "Linux EFI Stub" -l '\EFI\gentoo\bzImage.efi' -u 'root=/dev/nvme0n1p3' # without initramfs
efibootmgr -c -d /dev/nvme0n1 -p 2 -L "Linux EFI Stub" -l '\EFI\gentoo\bzImage.efi' -u 'initrd=\EFI\gentoo\initramfs.img' # with initramfs
</pre></div>
<p>After checking if the system can successfully boot, you can
unmerge <code>efibootmgr</code>. Just copy new kernel images and
initramfs to the same position on the EFI partition.</p>
</div>
</div>
<div id="outline-container-orgfa56187" class="outline-2">
<h2 id="orgfa56187"><span class="section-number-2">6.</span>
Troubleshoot</h2>
<div class="outline-text-2" id="text-6">
<p>If you encountered the common <q>VFS: Cannot open root device or
unknown block</q> error, don't panic.</p>
<ol class="org-ol">
<li>Remember to supply the kernel with a
<code>root=/dev/&lt;block&gt;</code> option using <code>-u</code>
option of <code>efibootmgr</code> or the kernel built-in command
line. An initramfs generated by for instance dracut might also
contain one.</li>
<li>If you specified the system root partition using kernel
build-in command line or by <code>UUID</code>, you need an
initramfs.</li>
<li>If you use brtfs subvolumes, you need an initramfs.</li>
<li>Try the <code>rootwait</code> option if an initramfs is not
used and the root filesystem is on an MTD device (such as an NVME
drive) to make the kernel wait for asynchronous initialization of
the device.</li>
</ol>
<p>Well, always try building an initramfs and see if the error
disappears.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: RadioNoiseE</p>
<p class="date">Created: 2024-12-27 Fri 10:33</p>
<p class="validation"><a href=
"https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
